# InstanceBinding Constructor (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
InstanceBinding Constructor
InstanceBinding Class See Also
---
Constructs an empty instance binding.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public InstanceBinding()
```

Visual Basic
---
```text
Public Sub New
```

Visual C++
---
```text
public:
InstanceBinding()
```

# Remarks
Categories can be set a later time by using the Categories property of this object.
# See Also
InstanceBinding Class
InstanceBinding Overload
Autodesk.Revit.DB Namespace